[{"month": "3", "num": 400, "link": "", "year": "2008", "news": "", "safe_title": "Important Life Lesson", "transcript": "Important life lesson: if there's any possibility of sex, do not leave your music library on \"shuffle all.\n[[A woman lies down in a bed, while someone is beneath the bed sheets with the head between her legs. ON the other side of the room, a computer is turned on and playing music]]\nWoman: *GASP* MMMMM_\nComputer: GO GO POWER RANGERS\n{{title text:I didn't even know I *had* the Monty Python 'Lumberjack' song.}}", "alt": "I didn't even know I *had* the Monty Python 'Lumberjack' song.", "img": "https://imgs.xkcd.com/comics/important_life_lesson.png", "title": "Important Life Lesson", "day": "24"},{"month": "3", "num": 401, "link": "", "year": "2008", "news": "", "safe_title": "Large Hadron Collider", "transcript": "The Large Hadron Collider, CERN...\nWoman: Okay, moment of truth. <<click>>\n<<VVVVVRRMMMMM>>\nMan: Do you see the Higgs Boson?\nWoman: Nope.\nMan: Huh.\nWoman: Well, then.\nMan: Until the theorists get back to us, wanna try hitting pigeons with the proton stream?\nWoman: Already on it. Cool! I just gave a helicopter cancer.\n{{Alt text: When charged particles of more than 5 TeV pass through a bubble chamber, they leave a trail of candy.}}", "alt": "When charged particles of more than 5 TeV pass through a bubble chamber, they leave a trail of candy.", "img": "https://imgs.xkcd.com/comics/large_hadron_collider.png", "title": "Large Hadron Collider", "day": "26"},{"month": "3", "num": 402, "link": "", "year": "2008", "news": "", "safe_title": "1,000 Miles North", "transcript": "[[Van and truck travel toward mountains]]\nNarrator: 1,000 miles north of tornado alley\nNarrator: a new breed of scientists has emerged.\n[[Man with a laptop, woman with a probe in the ground]]\nNarrator: Half researchers, half adrenaline junkies\nWoman: What's the reading?\nMan: 3.9 meters down, gradient's off the charts!\n[[Truck driving very fast, man holding a radio up to his head]]\nNarrator: risking everything for the thrill of the hunt\nMale: The freeze line is shifting! We've never seen anything like it!\n[[4 - Barren field, mountains in background, woman holding large video camera up to tiny spot of grass]]\nNarrator: Permafrost chasers\nFemale: I'm getting some great footage here!\nRadio: Dammit, Harding, it's not worth your neck! Get the hell out of there!\n{{Title Text: Twister would've been a much better movie if they'd cut out the bad-guy storm chaser and all the emotional romance crap.  All you need for a good movie are tornados and scientists.  Actually, that's all you need for anything.}}", "alt": "Twister would've been a much better movie if they'd cut out the bad-guy storm chaser and all the emotional romance crap.  All you need for a good movie are tornados and scientists.  Actually, that's all you need for anything.", "img": "https://imgs.xkcd.com/comics/1000_miles_north.png", "title": "1,000 Miles North", "day": "28"},{"month": "3", "num": 403, "link": "", "year": "2008", "news": "", "safe_title": "Convincing Pickup Line", "transcript": "[[A couple sit at the small table of a cafe.  The woman holds up a graph.]]\nWoman: We're a terrible match.  But if we sleep together, it'll make the local hookup network a symmetric graph.\nMan: I can't argue with that.\n{{Title text: Check it out; I've had sex with someone who's had sex with someone who's written a paper with Paul ErdÅ\u0091s!}}", "alt": "Check it out; I've had sex with someone who's had sex with someone who's written a paper with Paul Erdős!", "img": "https://imgs.xkcd.com/comics/convincing_pickup_line.png", "title": "Convincing Pickup Line", "day": "31"},{"month": "4", "num": 405, "link": "", "year": "2008", "news": "XKCD updates every Monday, Wednesday, and Friday.<br />Previously: <a href=\"https://xkcd.com/374/\">Journal</a> and <a href=\"https://xkcd.com/377\">Journal 2</a>", "safe_title": "Journal 3", "transcript": "[[Two women ice-skating outside]]\nBlonde: Wait up!\nBrunette (wearing Hat Guy's Hat): Skate faster!\n[[Brunette sees cracking ice]] \n<<Crack>> <<Crack>>\n[[Brunette on chunk of ice broken off]] \n<<Crack>> <<Rumble>>\n[[Submarine dorsal fin emerging]]\n<<Awooga>>\n[[Hat Guy (minus hat) coming out of door]]\nHat Guy: Hi.  \nHat Guy: That's my hat you're wearing.\nBrunette (wearing Hat Guy's Hat):  So, you found me after all.\nHat Guy (out of frame): You didn't make it easy.\nHat Guy: You saw through me, all right.  But not quite well enough.\nHat Guy: Because if you wanted to stay lost forever, you made one mistake\n[[Hat Guy sliding down a sheet of ice]]\nHat Guy: You took my hat.\n[[Hat Guy swipes hat off of Brunette]]\n[[Hat Guy puts it on his head while sliding]]\nHat Guy: You took my hat.\nHat Guy: I LIKE my hat.\n[[Hat guy walking away]]\n[[Brunette left standing there]]\n{{title text: Oh, and, uh, if the Russian government asks, that submarine was always there.}}", "alt": "Oh, and, uh, if the Russian government asks, that submarine was always there.", "img": "https://imgs.xkcd.com/comics/journal_3.png", "title": "Journal 3", "day": "2"},{"month": "4", "num": 406, "link": "", "year": "2008", "news": "", "safe_title": "Venting", "transcript": "[[Above frame]]  When I need to blow off steam, I find a particularly stupid blog comment and reply with an exhaustively researched word-by-word rebuttal, which I sign \"Summer Glau\".\n[[Guy sitting at computer typing away]] ... In conclusion, on examining the above post by CrackMonkey74, after carefully working my way through the haze of spelling errors (documented in section 3), abuse of capitalization (section 4), and general crimes against grammar and syntax (sections 7-8), I have demonstrated that, beneath it all, the work betrays the author's staggering ignorance of the history and the workings of our electoral system.  While the author's wildly swerving train of thought did at one point flirt with coherence, this brief encounter was more likely a chance event (see statistical analysis in table 5) than a result of even rudimentary lucidity.\n     -Summer Glau\nP.S. Don't forget to check out the next season of the Sarah Connor Chronicles this fall on Fox!\n{{title text: P.P.S. I can kill you with my brain.}}", "alt": "P.P.S. I can kill you with my brain.", "img": "https://imgs.xkcd.com/comics/venting.png", "title": "Venting", "day": "4"},{"month": "4", "num": 407, "link": "", "year": "2008", "news": "", "safe_title": "Cheap GPS", "transcript": "[[Guy driving down the road, with a GPS reading \"COLD\"]] \nGPS: COLD... WARM... HOT! COLD...\n{{title text: In lieu of mapping software, I once wrote a Perl program which, given a USB GPS receiver and a destination, printed 'LEFT' 'RIGHT' OR 'STRAIGHT' based on my heading.}}", "alt": "In lieu of mapping software, I once wrote a Perl program which, given a USB GPS receiver and a destination, printed 'LEFT' 'RIGHT' OR 'STRAIGHT' based on my heading.", "img": "https://imgs.xkcd.com/comics/cheap_gps.png", "title": "Cheap GPS", "day": "7"},{"month": "4", "num": 408, "link": "", "year": "2008", "news": "", "safe_title": "Overqualified", "transcript": "[On phone] \nGirl: I know you're not that into my sister, but she's really crushing on you.\nBoy: Yeah, it's awkward.\nGirl: She's in a rough spot.  It's a lot to ask, but could you take her out and ... dissuade her, without rejecting her?\nBoy: Wait a second.  Are you asking me to show her a mediocre time?\nGirl: I know it's a weird--\nBoy: [Raising index finger.] No, no! This is the mission I was _born_ for.\nGirl: I figured you could handle it.\nBoy: One of my classic high-school dates coming up!\nGirl: Oh God.  Don't overdo it.\n[Alt text: To anyone I've taken on a terrible date, this is retroactively my cover story.]", "alt": "To anyone I've taken on a terrible date, this is retroactively my cover story.", "img": "https://imgs.xkcd.com/comics/overqualified.png", "title": "Overqualified", "day": "9"},{"month": "4", "num": 409, "link": "", "year": "2008", "news": "", "safe_title": "Electric Skateboard (Double Comic)", "transcript": "[[Guy showing off electric skateboard to girl reading something]]\nGuy: Check it out! An electric longboard!\nGirl: Sweet!\n[[Guy riding longboard with girl sitting onboard -- people in background]]\nLongboard: <<RRRR>>\n[[Girl turned around on longboard]]\nGirl: I feel like we're missing something...\nGuy: Yeah...\n[[Guy throwing 3 green Koopa Troopa shells; girl throwing 1 red Koopa Troopa shell -- like Mario Kart]]\n<<Music Playing>>\nLongboard: <<RRRR>>\n\n[[Guy and girl still on longboard, going up an incline]]\nGuy: Skating uphill like this is amazing.  Years of gliding downhill and pushing uphill, and now suddenly it's gliding both ways.\nLongboard: <<RRRR>>\n[[Guy and girl after passing an S-curve and boulder]]\nGuy: It's like going from C to Python.  You don't realize how much time you were spending on the boring parts until you don't have to do them anymore.\nGirl: But coding C or assembly makes you a better programmer.  Maybe the boring parts build character.\n[[Guy and girl on longboard...]]\nGuy: Yeah... but it depends how you want to spend your life.  See, my philosophy is --\n[[Longboard get into an accident]]\n<<*WHAM*>>\n[[Calvin and Hobbes laying down in the grass near the guy and girl laying down on the grass -- Calin and Hobbes's wagon is on the path, as is the longboard -- all characters seeing stars]]\n{{Title text: Unsafe vehicles, hills, and philosophy go hand in hand.}}", "alt": "Unsafe vehicles, hills, and philosophy go hand in hand.", "img": "https://imgs.xkcd.com/comics/electric_skateboard_double_comic.png", "title": "Electric Skateboard (Double Comic)", "day": "11"},{"month": "4", "num": 410, "link": "", "year": "2008", "news": "", "safe_title": "Math Paper", "transcript": "Lecturer: In my paper, I use an extension of the divisor function over the Gaussian integers to generalize the so-called \"friendly numbers\" into the complex plane. [[Points to equations on the board]]\nGuy in room: Hold on.  Is this paper simply a build-up to an \"imaginary friends\" pun?\n[[Lecturer stands speechless]]\nLecturer: It MIGHT not be.\nGuy in room: I'm sorry, we're revoking your math license.\n{{Alt: That's nothing. I once lost my genetics, rocketry, and stripping license in a single incident.}}", "alt": "That's nothing.  I once lost my genetics, rocketry, and stripping licenses in a single incident.", "img": "https://imgs.xkcd.com/comics/math_paper.png", "title": "Math Paper", "day": "14"},{"month": "4", "num": 411, "link": "", "year": "2008", "news": "", "safe_title": "Techno", "transcript": "[[Guy looking over girl's shoulder while girl is clicking her mouse with her other hand on her chin]]\nGuy: Wait, you're buying techno on iTunes?\nGirl: Yeah. So?\nGuy: Couldn't you just loop the 15-second free sample 20 times and get basically the same thing?\n{{title text: I don't know what's worse -- that there exists broken-hard-drive-sound techno, or that it's not half bad.}}", "alt": "I don't know what's worse -- that there exists broken-hard-drive-sound techno, or that it's not half bad.", "img": "https://imgs.xkcd.com/comics/techno.png", "title": "Techno", "day": "16"},{"month": "4", "num": 412, "link": "", "year": "2008", "news": "", "safe_title": "Startled", "transcript": "[[Man and woman standing to one side, looking and pointing at guy in black hat who is facing away.]]\n[[Woman sneaks up on Black Hat Guy.]]\n[[Close-up of woman with hands raised.]]\nWoman: Boo!\n[[Black Hat Guy looks shocked, and his hat jumps.]]\n[[The hat falls down over his head.]]\n[[The hat keeps falling, with only his legs still visible.]]\n[[The hat hits the ground.]]\n<<FWUMP>>\n[[Man and woman look at the hat.]]\n[[The hat scurries away.]]\n<<SCOOCH SCOOCH SCOOCH>>\n{{title text: ...}}", "alt": "...", "img": "https://imgs.xkcd.com/comics/startled.png", "title": "Startled", "day": "18"},{"month": "4", "num": 413, "link": "", "year": "2008", "news": "", "safe_title": "New Pet", "transcript": "[[Girl is placing EEE PC inside hamster ball. Guy scratches head]]\nGuy: What are you doing?\nGirl: Mounting your EEE PC in a hamster ball.\nGirl: Well, the TCO of a cat is like $1000\nyear, so we're saving money.\n[[Guy is typing]]\nGirl: Microcontrollers are all wired up. How's the brain coming?\nGuy: I've taught it obstacle avoidance and blogging.\nGuy: Aww, look, it's making friends with the Roomba.\"\n<<EEE PC: RRRRR>>\n<<Roomba: Beep!>>\nDiagram: Webcam, RF links, bearings, omni wheels, magnets, EEE PC, omni wheels, battery\n[[Hamster ball bounces down flight of stairs]]\n<<Hamster ball: Bonk, bonk>>\nOff-panel: Man, I hope it's OK that we're laughing at this.\n[[Girl picks up ball]]\nGirl: I think my mothering instinct took a wrong turn somewhere.\nGuy: You mean an awesome turn.\n[[Guy is typing]]\nGirl: Too bad we can't give it a soul.\nGuy: Sure we can. \nGuy types: import soul\nGirl: Oh, right. Python.\n{{Title text: ONE LAPTOP PER HAMSTER}}", "alt": "ONE LAPTOP PER HAMSTER!", "img": "https://imgs.xkcd.com/comics/new_pet.png", "title": "New Pet", "day": "21"},{"month": "4", "num": 414, "link": "", "year": "2008", "news": "", "safe_title": "Mistranslations", "transcript": "[A bed sits on the ground in the middle of the frame. At the left of the frame, a man stands atop a skateboard jump ramp twice his height, one foot on the back of a skateboard poised over the coping. At the bottom of the ramp is a small kicker ramp which will launch him over the bed. A woman to the right of the frame stands on the roof of a house grasping a rope which is affixed directly over the bed. They are both poised to begin their motion.]\nOur copy of the Kama Sutra has a couple mistranslations.\nWhich we refuse to fix.\n{{Alt: Oh, I think this word might mean 'Crisco'!}}", "alt": "Oh, I think this word might mean 'Crisco'!", "img": "https://imgs.xkcd.com/comics/mistranslations.png", "title": "Mistranslations", "day": "23"},{"month": "4", "num": 415, "link": "", "year": "2008", "news": "", "safe_title": "Restraining Order", "transcript": "[[Man and woman stand facing one another. Both hold sheets of paper.]]\nText reads: Not content with normal restraining orders, my ex got creative.\nMan: Wait... I can't get closer than 500 yards of you... or more than 600 yards away?\nWoman: You'll have to move somewhere within this ring.\n{{title text: On Mondays I go running, so you'll have to get up early and follow along a parallel street. What fun!}}", "alt": "On Mondays I go running, so you'll have to get up early and follow along on a parallel street.  What fun!", "img": "https://imgs.xkcd.com/comics/restraining_order.png", "title": "Restraining Order", "day": "25"},{"month": "4", "num": 416, "link": "", "year": "2008", "news": "", "safe_title": "Zealous Autoconfig", "transcript": "[[Guy sitting on a chair with his laptop in his lap]]\nLaptop: Starting WiFi autoconfig... searching for WiFi... Found no open networks.\nLaptop: Found secure net SSID \"Lenhart Family\"\nLaptop: Trying common passwords... Failed.  Checking for WEP Vulnerabilities...\nGuy: Um.\nLaptop: None found.\n[[Guy still sitting with laptop in his lap, but hand is on chin.  Phone on table across room starts vibrating]]\nLaptop: Connecting to Bluetooth phone... Calling local school... Found Lenhart children.\n[[Guy furiously typing on his laptop]]\nLaptop: Notifying field agents.  Children acquired.  Calling Lenhart parents.  Negotiating for WiFi password...\n<<CTRL-C  CTRL-C>>\n{{Title text: I hear this is an option in the latest Ubuntu release.}}", "alt": "I hear this is an option in the latest Ubuntu release.", "img": "https://imgs.xkcd.com/comics/zealous_autoconfig.png", "title": "Zealous Autoconfig", "day": "28"},{"month": "4", "num": 417, "link": "", "year": "2008", "news": "", "safe_title": "The Man Who Fell Sideways", "transcript": "[[A man standing, with a dotted line perpendicular to him and a 30 degree angle going downwards]]\nNarrator: From a young age, gravity pulled him wrong.\n[[The same man bouncing around his house]]\nNarrator: Sometimes east, sometimes west.  When he was restrained, it grew erratic.\n<WHAM> <WHAM>\n[[Man bouncing\nrolling on the ground]]\nNarrator: So he fell.\nMan: AAAA\n<THUMPA> <THUMPA>\n[[Man bouncing\nrolling on the ground in a desert]]\nNarrator: Constantly\nMan: AAAAAAAAA\n[[Man bouncing\nrolling off a rock on the ground in a desert]]\nNarrator: Over land...\nMan: AAAAA-<THUD>-A\n[[Man bouncing\nrolling on the ground in the desert]]\nMan: AAAAAAAAA\n[[Man bouncing\nrolling on the ground in the desert]]\nMan: A-<THUD>-AAAAAA\n[[Man bouncing\nrolling on the ground in the desert]]\nMan: AA-<THUD>-AAAAA\n[[Man under the surface of a body of water]]\nNarrator: And sea.\nMan: AAAAAAAAAAAA\n[[Man still under the surface of a body of water]]\nMan: AAAAAAAA\n[[Man temporarily standing on the surface of the body of water]]\nMan: AAAAAA\n[[Man under the surface of the body of water]]\nMan: AAAAAAAA\n[[Tree in the savanna, with the man off the panel]]\nNarrator: He found, where he could, food-\nMan: AAAAAAAAAAAA\n[[Tree in the savanna, with the man still off the panel, but zoomed out so that part of the man's bounce\nroll path is visible]]\nMan: AAAAAAAAA\n[[Man upside-down, still bouncing\nrolling in the savannah, with a gazelle galloping away from him]]\n<GALLOP> <GALLOP>\nMan: AAAAAAAAA\n[[Savanna with a tree in it]]\nMan: AAAAAAAAAAA\n[[Woman standing, with the man off screen]]\nNarrator: And love.\nMan: AAAA-<THUD>-AAAA\n[[Woman standing, with the man off screen]]\nMan: <THUD> ACK <CRASH>\n[[Man crashing into woman]]\nWoman: Hiwhat'syourname-\n<WHAM>\n[[Woman on the ground, with the man off screen]]\nMan: AAAAAAA-<THUD>-AAA\n[[Woman speaking to another man]]\nWoman: I met this guy.  He knocked me over and tumbled into the distance.\n[[Woman speaking to the same man from the previous panel, with the man's hand to his mouth]]\nWoman: We only shared a few seconds, but in his panicked scream I heard something beautiful.\n[[Woman speaking to the same man from the previous panel]]\nWoman: I think... I think I'm...\n[[Woman speaking to the same man from the previous panel]]\nMan: Falling for him?\nWoman: I wasn't going to say it.\n[[Woman at hospital with doctor, giving birth]]\nNarrator: She never saw him again.  But nine months later...\nDoctor: Okay, push!\n[[Woman at hospital with doctor and new baby, who is bouncing\nrolling away]]\nDoctor: It's a gir-\nWoman: !!\nDoctor: Whoops!\nBaby: Ga! Ga!\n[[Baby bouncing\nrolling out of hospital]]\nBaby: WHEEEEEEEEEEEEE\n[[Baby bouncing\nrolling in front of a sunset]]\nBaby: EEEEEEEEEEEEEEEEEEE\nNarrator: The End\n{{alt text: Strip originally conceived in conversation with Jeph Jacques.  Soon to be a major motion picture.}}", "alt": "Strip originally conceived in conversation with Jeph Jacques.  Soon to be a major motion picture.", "img": "https://imgs.xkcd.com/comics/the_man_who_fell_sideways.png", "title": "The Man Who Fell Sideways", "day": "30"},{"month": "5", "num": 418, "link": "", "year": "2008", "news": "", "safe_title": "Stove Ownership", "transcript": "[[Hand-drawn Graph is shown, on the Y axis, My Overall Health, on the X axis, Time.  Graph is generally steady through 3\n4 of the X axis, where is begins a steady decline, with a label \"The Day I Realized I Could Cook Bacon Whenever I Wanted.\"]]\n{{Title Text: Although maybe it's just a phase, like freshman year of college when I realized I could just buy frosting in a can.}}", "alt": "Although maybe it's just a phase, like freshman year of college when I realized I could just buy frosting in a can.", "img": "https://imgs.xkcd.com/comics/stove_ownership.png", "title": "Stove Ownership", "day": "2"},{"month": "5", "num": 419, "link": "", "year": "2008", "news": "", "safe_title": "Forks and Spoons", "transcript": "[[Presenter with pointer stick]] Presenter: A spoon crossed with a fork is a spork.\nOff-panel presenter's voice: Our lab has successfully crossed a spork with a spoon. [[Diagram showing the fractions of fork and spoon in each item.]]\n[Chart showing possible combinations of spoons a forks.]\n[[Presenter in front of audience]] \nPresenter: With your funding, we could create hybrids in proportions corresponding to any binary fraction.\n[[Fork-Spoon Spectrum]]\nAudience member: You're toying with powerful forces here.\nPresenter: We know what we're doing.\nPanel Title: Two weeks later:\n[[Picture of a destroyed lab with two dead bodies, blood everywhere and a spoon-fork hybrid hopping away.]]\n{{title text: Their biggest mistake was bringing Rachel Ray and Emeril to tour the lab and sign off on the project. That's when Spielberg caught wind of it.}}", "alt": "Their biggest mistake was bringing Rachael Ray and Emeril to tour the lab and sign off on the project.  That's when Spielberg caught wind of it.", "img": "https://imgs.xkcd.com/comics/forks_and_spoons.png", "title": "Forks and Spoons", "day": "5"},{"month": "5", "num": 420, "link": "", "year": "2008", "news": "", "safe_title": "Jealousy", "transcript": "[[Dark scene shown, with man and girl sitting in the moonlight let in by the only window.]]\nMegan and I first met at a party at her sister's.\nWe hit it off, opened up, shared secrets, and talked about everything. Around us, the party waned, but we hid from sleep together, talking through the deepest hours of the night.\nThe dawn found us curled up on a couch, asleep but still together.\nThat experience, connecting with a stranger and falling recklessly in love is one of life's greatest joys.\nAnd now that you're married, you'll never experience it again.\nIt's the price you pay for everlasting love. It's a small one, but I hope it stings a little.\nAnyway, I wish you and Megan the best. \n...Hey, man, you ASKED me to do a toast.\n{{title text: Oh, huh, so you didn't know that story?]]", "alt": "Oh, huh, so you didn't know that story?", "img": "https://imgs.xkcd.com/comics/jealousy.png", "title": "Jealousy", "day": "7"}]